Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `environments/production` workspace: `default`
---

### 1. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ebs_volume.vol_test_atlantis1 will be created
+ resource "aws_ebs_volume" "vol_test_atlantis1" {
      + arn               = (known after apply)
      + availability_zone = "eu-central-1a"
      + create_time       = (known after apply)
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 4
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "test_vol_atlantis"
        }
      + tags_all          = {
          + "Name"       = "test_vol_atlantis"
          + "managed_by" = "Terraform_atlantis"
        }
      + throughput        = (known after apply)
      + type              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.training.starfish-rentals.com/lock?id=mastercam123%252Fs3_lambda_app%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `environments/production` workspace: `default`
**Plan Error**
```
running 'sh -c' '/home/atlantis/.atlantis/bin/terraform1.11.3 init -input=false -upgrade' in '/home/atlantis/.atlantis/repos/mastercam123/s3_lambda_app/15/default/environments/production': exit status 1
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Error refreshing state: Unable to access object "lambda-hsn/terraform.tfstate" in S3 bucket "tf-state-bucket-dvt-poc": operation error S3: HeadObject, https response error StatusCode: 403, RequestID: CNRTJDG45RJPAENN, HostID: 1Cnd3boiEcF+08w9k+JuXwZbHsZoqrdRgSt5cbd2CP45Qb7wO1UijZ7J8kwkKt9xEeowODBjIg8=, api error Forbidden: Forbidden
│ 
│ 
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```